

#ifndef  WINDOWS_H
#define  WINDOWS_H

#include    "gui_config.h"

/* 定义窗口数据结构 */
typedef  struct
{  
	uint32_t x;				// 窗口位置(左上角的x坐标)
	uint32_t y;				// 窗口位置(左上角的y坐标)

	uint32_t width;			// 窗口宽度
	uint32_t height;		// 窗口高度
	uint32_t itemsperpage;	// 窗口可显示项目个数
	uint32_t topitem;		//最顶端的条目
	const uint8_t *title;	// 定义标题栏指针
} WINDOWS;



/****************************************************************************
* 名称：GUI_WindowsDraw()
* 功能：显示窗口。根据提供的窗口参数进行画窗口
* 入口参数：dat		填充的数据(对于黑白色LCM，为0的点灭，为1的点显示)
* 出口参数：返回0表示操作失败，返回1表示操作成功
****************************************************************************/
extern  uint8_t  GUI_WindowsDraw(WINDOWS *win);



/****************************************************************************
* 名称：GUI_WindowsHide()
* 功能：消隐窗口。
* 入口参数：win		窗口句柄
* 出口参数：返回0表示操作失败，返回1表示操作成功
****************************************************************************/
extern uint8_t  GUI_WindowsDelete(WINDOWS *win);



/****************************************************************************
* 名称：GUI_WindowsClr()
* 功能：清屏窗口。
* 入口参数：win		窗口句柄
* 出口参数：无
* 说明：使用此函数前要先使用GUI_WindowsDraw()将窗口画出。
****************************************************************************/
extern  void  GUI_WindowsClr(WINDOWS *win);

//测试窗体函数
void test_window(void);

#endif
